import java.util.Scanner;
//Сравнение чисел: Напишите программу, которая сравнивает два числа и определяет, равны ли они или одно больше другого.
//Входные данные 5 8
//
//Результат Первое число больше второго.

public class firstexample {
    public static void main(String[] args) {
        int a = 8;
        if (a > 5) {
            System.out.println("Первое число больше второго");
        } else {
            System.out.println("Первое число меньше второго");
        }




    }
}
