public class second {
    //Проверка на четность: Напишите программу, которая определяет, является ли введенное число четным или нечетным.
    //Входные данные 12
    //
    //Результат Число четное.
    public static void main(String[] args) {
        int x =12;
        switch (x) {
            case 1:
                System.out.println("Число нечетное");
                break;
            case 2:
                System.out.println("Число четное");
                break;
            case 3:
                System.out.println("Число нечетное");
                break;
            case 4:
                System.out.println("Число четное");
                break;
            case 5:
                System.out.println("Число нечетное");
                break;
            case 6:
                System.out.println("Число четное");
                break;
            case 7:
                System.out.println("Число нечетное");
                break;
            case 8:
                System.out.println("Число четное");
                break;
            case 9:
                System.out.println("Число нечетное");
                break;
            case 10:
                System.out.println("Число четное");
                break;
            case 11:
                System.out.println("Число нечетное");
                break;
            case 12:
                System.out.println("Число четное");
                break;





        }
    }
}
